In [1]:
# uvoz modulov
import pandas as pd
import numpy as np
import random

# Podatkovne tabele in poravnava indeksov

## Poravnava indeksov

### Kdaj imamo lahko težave s poravnavo indeksov?

1. Sestavi zaporedje kvadratov `kvadrati` naravnih števil od 0 do 20. Izračunati želimo zaporedje razlik : $x_1 - x_0$, $x_2 - x_1$, ...., $x_{20} - x_{19}$.
2. Ustvari novo zaporedje, ki je sestavljeno iz kvadratov, zamaknjenih za ena "navzgor" - poravnati želimo 0 z 1, 1 s 4, 4 z 9, ...
3. Ustvari podatkovno tabelo iz obeh zaporedij. 
4. Dodaš nov stolpec z razlikami, kot je opisano zgoraj. 

Preveri rezultat in razmisli: smo dobili pričakovani rezultat in zakaj (ne)? Kaj se zgodi s podatkovnim tipom zamaknjenega stolpca in zakaj?

In [2]:
zap = pd.Series([i**2 for i in range(21)])
zamaknjeno = zap[1:]
df = pd.DataFrame({"z1": zap, "z2": zamaknjeno})
df["razlike"] = df.z2 - df.z1
print(df)

     z1     z2  razlike
0     0    NaN      NaN
1     1    1.0      0.0
2     4    4.0      0.0
3     9    9.0      0.0
4    16   16.0      0.0
5    25   25.0      0.0
6    36   36.0      0.0
7    49   49.0      0.0
8    64   64.0      0.0
9    81   81.0      0.0
10  100  100.0      0.0
11  121  121.0      0.0
12  144  144.0      0.0
13  169  169.0      0.0
14  196  196.0      0.0
15  225  225.0      0.0
16  256  256.0      0.0
17  289  289.0      0.0
18  324  324.0      0.0
19  361  361.0      0.0
20  400  400.0      0.0

5. Popravi indekse drugega (zamaknjenega) zaporedja, da bo število 1 na ničtem indeksu, 4 na prvem, 9 na drugem, ...
6. Ponovno ustvari tabelo in izračunaj razlike. (Vsi elementi morajo biti večji od nič).
7. Izpiši podatkovno tabelo z vsemi tremi stolpci.

In [3]:
zap = pd.Series([i**2 for i in range(21)])
zamaknjeno = zap[1:]
zamaknjeno.index = zap.index[0:-1]
df2 = pd.DataFrame({"z1": zap, "z2": zamaknjeno})
df2["razlike"] = df2.z2 - df2.z1
print(df2)

     z1     z2  razlike
0     0    1.0      1.0
1     1    4.0      3.0
2     4    9.0      5.0
3     9   16.0      7.0
4    16   25.0      9.0
5    25   36.0     11.0
6    36   49.0     13.0
7    49   64.0     15.0
8    64   81.0     17.0
9    81  100.0     19.0
10  100  121.0     21.0
11  121  144.0     23.0
12  144  169.0     25.0
13  169  196.0     27.0
14  196  225.0     29.0
15  225  256.0     31.0
16  256  289.0     33.0
17  289  324.0     35.0
18  324  361.0     37.0
19  361  400.0     39.0
20  400    NaN      NaN

### Kako združiti zaporedja?

Dani so podatki o študentih, ki so vpisani v predmet ter ocenah prvega izpitnega roka:

* seznam `sez_studenti` vsebuje pare oblike `(<vpisna številka>, <ime>)`, 
* seznam `sez_ocene` vsebuje pare oblike `(<vpisna številka>, <ocena>)`.

In [4]:
sez_studenti = [("124174", "Maja"), ("223974", "Tilen"), ("341842", "Petra"), ("418623", "Blaž"), ("527421", "Katja"), ("620516", "Benjamin"), ("729516", "Urban"), ("828651", "Pija")]
sez_ocene = [("124174", 5), ("341842", 7), ("527421", 10), ("729516", 9), ("418623", 8), ("915715", 6), ("014153", 7)]

Ustvari zaporedji `studenti` ter `ocene`, ki imata za indeks vpisno številko:

In [5]:
studenti = pd.Series([ime for _, ime in sez_studenti], index=[vp_st for vp_st, _ in sez_studenti])
ocene = pd.Series([ocena for _, ocena in sez_ocene], index=[vp_st for vp_st, _ in sez_ocene])

Ustvari podatkovno tabelo `rezultati_1` s stolpcema `student` in `ocena`. Kako `pandas` združi stolpca v isto tabelo?

In [6]:
rezultati_1 = pd.DataFrame({"student": studenti, "ocena": ocene})
rezultati_1

         student  ocena
014153       NaN    7.0
124174      Maja    5.0
223974     Tilen    NaN
341842     Petra    7.0
418623      Blaž    8.0
527421     Katja   10.0
620516  Benjamin    NaN
729516     Urban    9.0
828651      Pija    NaN
915715       NaN    6.0

V tabeli `rezultati_2` združi zaporedji tako, da bodo v njej le študenti, ki so vpisani v predmet:
<details><summary>Namig</summary>
Oglej si, kako deluje metoda <code>align</code>.
</details>

In [7]:
s2p, o2p = studenti.align(ocene, join="left")
rezultati_2 = pd.DataFrame({"student": s2p, "ocena": o2p})
rezultati_2

         student  ocena
124174      Maja    5.0
223974     Tilen    NaN
341842     Petra    7.0
418623      Blaž    8.0
527421     Katja   10.0
620516  Benjamin    NaN
729516     Urban    9.0
828651      Pija    NaN

V tabeli `rezultati_3` združi zaporedji tako, da bodo v njej le študenti, ki so pisali prvi izpit:

In [8]:
s3p, o3p = studenti.align(ocene, join="right")
rezultati_3 = pd.DataFrame({"student": s3p, "ocena": o3p})
rezultati_3

       student  ocena
124174    Maja      5
341842   Petra      7
527421   Katja     10
729516   Urban      9
418623    Blaž      8
915715     NaN      6
014153     NaN      7

V tabeli `rezultati_4` združi zaporedji tako, da bodo v njej le študenti, ki so vpisani v predmet in so pisali prvi izpit:

In [9]:
s4p, o4p = studenti.align(ocene, join="inner")
rezultati_4 = pd.DataFrame({'student': s4p, 'ocena': o4p})
rezultati_4

       student  ocena
124174    Maja      5
341842   Petra      7
418623    Blaž      8
527421   Katja     10
729516   Urban      9

### Še en primer

Dane so meritve temperature zraka in višine vode v Kopru 29. oktobra med 6. in 12. uro. Temperatura je merjena vsako polno uro (tj. ob 6:00, 7:00, ...), višina vodostaja pa 10, 30 in 50 minut čez polno uro (tj. 6:10, 6:30, 6:50, 7:10, ...).

In [10]:
sez_temp = [12, 11.8, 13.4, 15.9, 18.6, 18.7, 19.5]
sez_voda = [252, 257, 260, 262, 262, 261, 259, 258, 256, 252, 249, 244, 238, 233, 226, 218, 210, 203]

Sestavi časovni vrsti `indeks_temp` in `indeks_voda`, ki vsebujeta čase meritev temperature in vode. Nato ustvari zaporedji temperatur in višine vodostaja ter jima nastavi ustrezna indeksa.

<details><summary>Ne veš kako se lotiti?</summary>
Pri tem si lahko pomagaš z indeksiranjem časovnega obdobja (angl. date range), lahko pa se poglobiš v <a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#combining-aliases">dokumentacijo</a> in poiščeš pomoč za ustvarjanje časovnih točk v poljubnih intervalih.
</details>

In [11]:
indeks_temp = pd.date_range("2024-10-28 06:00", "2024-10-28 12:00", freq="h")
indeks_voda = pd.date_range("2024-10-28 06:10", "2024-10-28 11:50", freq="20min")
zap_temp = pd.Series(sez_temp, index=indeks_temp)
zap_voda = pd.Series(sez_voda, index=indeks_voda)

Na podlagi zaporedij ustvari tabelo s stolpcema `temperature` in `visine`, ki ima za indeks časovne točke.

Kako izgleda dobljena tabela?

In [12]:
v1 = zap_voda
t1 = zap_temp
pd.DataFrame({"temperature": t1, "visine": v1})

                     temperature  visine
2024-10-28 06:00:00         12.0     NaN
2024-10-28 06:10:00          NaN   252.0
2024-10-28 06:30:00          NaN   257.0
2024-10-28 06:50:00          NaN   260.0
2024-10-28 07:00:00         11.8     NaN
2024-10-28 07:10:00          NaN   262.0
2024-10-28 07:30:00          NaN   262.0
2024-10-28 07:50:00          NaN   261.0
2024-10-28 08:00:00         13.4     NaN
2024-10-28 08:10:00          NaN   259.0
2024-10-28 08:30:00          NaN   258.0
2024-10-28 08:50:00          NaN   256.0
2024-10-28 09:00:00         15.9     NaN
2024-10-28 09:10:00          NaN   252.0
2024-10-28 09:30:00          NaN   249.0
2024-10-28 09:50:00          NaN   244.0
2024-10-28 10:00:00         18.6     NaN
2024-10-28 10:10:00          NaN   238.0
2024-10-28 10:30:00          NaN   233.0
2024-10-28 10:50:00          NaN   226.0
2024-10-28 11:00:00         18.7     NaN
2024-10-28 11:10:00          NaN   218.0
2024-10-28 11:30:00          NaN   210.0
2024-10-28 11:50:00          NaN   203.0
2024-10-28 12:00:00         19.5     NaN

Zaporedji poravnaj tako, da zaporedju temperatur nastaviš indeks zaporedja voda. 

<details><summary>Namig</summary>Oglej si delovanje metode <code>reindex</code>.</details>

Ponovno ju združi v tabelo, podobno tisti zgoraj. Kaj opaziš? Katere podatke obdržimo in kakšne so vrednosti obeh stolpcev?

In [13]:
t2 = zap_temp
v2 = zap_voda.reindex(t2.index, method="nearest")
pd.DataFrame({"temperature": t2, "visine": v2})

                     temperature  visine
2024-10-28 06:00:00         12.0     252
2024-10-28 07:00:00         11.8     262
2024-10-28 08:00:00         13.4     259
2024-10-28 09:00:00         15.9     252
2024-10-28 10:00:00         18.6     238
2024-10-28 11:00:00         18.7     218
2024-10-28 12:00:00         19.5     203

Zaporedji sedaj poravnaj tako, da zaporedju višin vode nastaviš indeks zaporedja temperatur. Dobimo isti nabor podatkov?

Naštej in preizkusi različne načine obravnave/zamenjave manjkajočih vrednosti. Kakšne so razlike?

In [14]:
v3 = zap_voda
t3 = zap_temp.reindex(v3.index, method="ffill")
pd.DataFrame({"temperature": t3, "visine": v3})

                     temperature  visine
2024-10-28 06:10:00         12.0     252
2024-10-28 06:30:00         12.0     257
2024-10-28 06:50:00         12.0     260
2024-10-28 07:10:00         11.8     262
2024-10-28 07:30:00         11.8     262
2024-10-28 07:50:00         11.8     261
2024-10-28 08:10:00         13.4     259
2024-10-28 08:30:00         13.4     258
2024-10-28 08:50:00         13.4     256
2024-10-28 09:10:00         15.9     252
2024-10-28 09:30:00         15.9     249
2024-10-28 09:50:00         15.9     244
2024-10-28 10:10:00         18.6     238
2024-10-28 10:30:00         18.6     233
2024-10-28 10:50:00         18.6     226
2024-10-28 11:10:00         18.7     218
2024-10-28 11:30:00         18.7     210
2024-10-28 11:50:00         18.7     203

## Naloge iz podatkovnih tabel

### 1. naloga: ITM

Iz zaporedij pri nalogi ITM, izračunanih na drugih vajah, sestavi podatkovno tabelo s štirimi stolpci, `ime`, `visina`, `teza` in `ITM`. Spremeni imena vrstic tako, da ustrezajo imenom oseb in nato zbriši stolpec ime. Indeksiraj dobljeno tabelo tako, da dobiš imena oseb, ki imajo ITM manj kot 26.

In [15]:
visine = pd.Series([180, 165, 160, 193])
teze = pd.Series([87, 58, 65, 100])
imena = pd.Series(["Aleš", "Barbara", "Ciril", "Darja"])
podatki = pd.DataFrame({"ime": imena, "visina": visine, "teza": teze})
podatki["itm"] = (podatki.teza / ((podatki.visina/100) ** 2)).round(2)
podatki.set_index("ime", inplace=True)
podatki

         visina  teza    itm
ime
Aleš        180    87  26.85
Barbara     165    58  21.30
Ciril       160    65  25.39
Darja       193   100  26.85

In [16]:
podatki.loc[podatki.itm <= 26].index

Index(['Barbara', 'Ciril'], dtype='object', name='ime')

### 2. naloga: naključna zaporedja
Ustvari dve zaporedji `x` in `y` dolžine 250 tako, da s ponavljanjem naključno izbiraš naravna števila iz intervala $[0, 999]$. Označimo z $x_1, x_2, \ldots, x_{250}$ in $y_1, y_2, \ldots, y_{250}$ elemente zaporedij `x` in `y`. Izračunaj:

* Zaporedje z elementi $y_2 - x_1, y_3 - x_2, \ldots, y_{250} - x_{249}$.
* Vsoto $\sum_{i=1}^{249} e^{- x_{i+1}} / (x_i + 10)$.

In [17]:
x = pd.Series([random.randint(0, 999) for _ in range(250)], index=list(range(1, 251)))
y = pd.Series([random.randint(0, 999) for _ in range(250)], index=list(range(1, 251)))

In [18]:
y1 = y[1:]
y1.index = list(range(1, 250))
razlike = y1-x
print(razlike)

1      797.0
2     -468.0
3        1.0
4      343.0
5      300.0
       ...
246    597.0
247    220.0
248   -410.0
249   -680.0
250      NaN
Length: 250, dtype: float64

Vse skupaj v eni tabeli za primerjavo:

In [19]:
df = pd.DataFrame({"x": x, "y": y, "zamaknjeno_y": y1, "razlike": razlike})
print(df)

       x    y  zamaknjeno_y  razlike
1    140  914         937.0    797.0
2    861  937         393.0   -468.0
3    257  393         258.0      1.0
4    298  258         641.0    343.0
5    533  641         833.0    300.0
..   ...  ...           ...      ...
246   35  789         632.0    597.0
247  600  632         820.0    220.0
248  918  820         508.0   -410.0
249  921  508         241.0   -680.0
250  532  241           NaN      NaN

[250 rows x 4 columns]

Računanje vsote $\sum_{i=1}^{249} e^{- x_{i+1}} / (x_i + 10)$:

In [20]:
x1 = x[1:]
x1.index = list(range(1, 250))
vsota = (np.e**(-x1)/(x+10)).sum()
vsota

0.00038674886151106194

### 3. naloga - temperature - 1. del

Dana je podatkovna tabela `temperature` s podatki o povprečni dnevni temperaturi zraka (v Celzijevih stopinjah) v Ljubljani v obdobju od začetka leta 2010 do konca 2019.

In [21]:
temperature = pd.read_csv("https://kt.ijs.si/~ljupco/lectures/papvp-2324/temp-lj-2010-2019.csv")

* Iz podatkovne tabele sestavi zaporedje `temp_lj`, kjer so indeksi datumi v opazovanem obdobju in vrednost elementa enaka povprečni temperaturi na ustrezen datum.
    * preveri pogostost (angl. _resolution_) indeksa (pričakujemo rezultat `"day"`)
    * temperaturo na božič 2015 (25. december)
    * izpiši temperature v juniju 2010
    * izpiši temperature med 19. decembrom 2012 in 3. januarjem 2013
* Z indeksiranjem zaporedja `temp_lj` sestavi novo zaporedje `temp_lj_petek` povprečnih temperatur ob petkih.
* Z indeksiranjem zaporedja `temp_lj` sestavi novo zaporedje `temp_lj_13` povprečnih temperatur za vsak datum, kjer je dan v mesecu enak 13.
* S poravnavo zaporedij `temp_lj_petek` in `temp_lj_13` sestavi novo zaporedje `temp_lj_petek_13` s povprečnimi temperaturami za vsak petek trinajstega v opazovanem obdobju.
* Z indeksiranjem zaporedja `temp_lj_petek_13` izpiši datuma za najbolj vroč in najbolj hladen petek trinajstega.
* Izračunaj povprečno temperaturo za datume, ki padejo na petek trinajstega v opazovanem obdobju.

In [22]:
temperature

           datum  povprecna_temperatura
0     2010-01-01                    6.9
1     2010-01-02                    2.5
2     2010-01-03                   -0.5
3     2010-01-04                   -3.3
4     2010-01-05                   -1.5
...          ...                    ...
3647  2019-12-27                    3.0
3648  2019-12-28                    0.7
3649  2019-12-29                   -1.4
3650  2019-12-30                   -2.3
3651  2019-12-31                   -0.3

[3652 rows x 2 columns]

1. Iz podatkovne tabele sestavi zaporedje `temp_lj`, kjer so indeksi datumi v opazovanem obdobju in vrednost elementa enaka povprečni temperaturi na ustrezen datum. 
    * preveri pogostost (angl. _resolution_) indeksa - pričakujemo rezultat `"day"`
    * temperaturo na božič 2015 (25. december)
    * izpiši temperature v juniju 2010
    * izpiši temperature med 19. decembrom 2012 in 3. januarjem 2013

In [23]:
temp_lj = temperature.povprecna_temperatura
temp_lj.index = pd.to_datetime(temperature.datum)

In [24]:
print("Resolucija: ", temp_lj.index.resolution)
print("Božič 2015: ", temp_lj['2015-12-25'])
print("Junij 2010:\n", temp_lj['2010-06'], '\n')
print("Zima 12/13: \n", temp_lj.loc["2012-12-19":"2013-01-03"], "\n")

Resolucija:  day
Božič 2015:  2.9
Junij 2010:
 datum
2010-06-01    17.0
2010-06-02    13.8
2010-06-03    15.1
2010-06-04    17.3
2010-06-05    18.9
2010-06-06    21.8
2010-06-07    23.0
2010-06-08    23.2
2010-06-09    23.5
2010-06-10    23.8
2010-06-11    24.7
2010-06-12    25.5
2010-06-13    24.9
2010-06-14    23.0
2010-06-15    20.6
2010-06-16    19.0
2010-06-17    20.1
2010-06-18    19.4
2010-06-19    16.5
2010-06-20    13.1
2010-06-21    14.8
2010-06-22    17.7
2010-06-23    19.3
2010-06-24    18.9
2010-06-25    20.9
2010-06-26    21.3
2010-06-27    22.1
2010-06-28    22.3
2010-06-29    23.7
2010-06-30    23.1
Name: povprecna_temperatura, dtype: float64

Zima 12/13:
 datum
2012-12-19    1.5
2012-12-20   -1.2
2012-12-21    0.6
2012-12-22    1.4
2012-12-23    3.1
2012-12-24    7.6
2012-12-25    9.2
2012-12-26    7.8
2012-12-27    4.1
2012-12-28    4.9
2012-12-29   -0.3
2012-12-30   -1.8
2012-12-31   -1.3
2013-01-01    2.5
2013-01-02    3.9
2013-01-03    4.1
Name: povprecna_temperatura, dtype: float64

2. Z indeksiranjem zaporedja `temp_lj` sestavi novo zaporedje `temp_lj_petek` povprečnih temperatur ob petkih.

In [25]:
temp_lj_petek = temp_lj.loc[pd.date_range(start="2010-01-01", end="2019-12-31", freq="W-Fri")]
print(temp_lj_petek)

2010-01-01     6.9
2010-01-08    -0.2
2010-01-15     0.9
2010-01-22    -2.2
2010-01-29    -4.6
              ...
2019-11-29     8.4
2019-12-06     0.6
2019-12-13     0.2
2019-12-20    10.4
2019-12-27     3.0
Name: povprecna_temperatura, Length: 522, dtype: float64

3. Z indeksiranjem zaporedja `temp_lj` sestavi novo zaporedje `temp_lj_13` povprečnih temperatur za vsak datum, kjer je dan v mesecu enak 13.

In [26]:
temp_lj_13 = temp_lj[temp_lj.index.day == 13]
print(temp_lj_13)

datum
2010-01-13    -0.3
2010-02-13    -0.3
2010-03-13     2.9
2010-04-13     6.7
2010-05-13    13.5
              ...
2019-08-13    21.7
2019-09-13    18.5
2019-10-13    15.0
2019-11-13     7.0
2019-12-13     0.2
Name: povprecna_temperatura, Length: 120, dtype: float64

4. S poravnavo zaporedij `temp_lj_petek` in `temp_lj_13` sestavi novo zaporedje `temp_lj_petek_13` s povprečnimi temperaturami za vsak petek trinajstega v opazovanem obdobju.

In [27]:
temp_lj_petek_13 = temp_lj_petek.align(temp_lj_13, join="inner")[0]
temp_lj_petek_13

2010-08-13    18.0
2011-05-13    19.9
2012-01-13     2.2
2012-04-13    10.5
2012-07-13    19.2
2013-09-13    13.8
2013-12-13    -0.3
2014-06-13    20.2
2015-02-13     2.9
2015-03-13     5.6
2015-11-13     6.6
2016-05-13    13.0
2017-01-13     1.7
2017-10-13    13.4
2018-04-13    13.1
2018-07-13    21.9
2019-09-13    18.5
2019-12-13     0.2
Name: povprecna_temperatura, dtype: float64

5. Z indeksiranjem zaporedja `temp_lj_petek_13` izpiši datuma za najbolj vroč in najbolj hladen petek trinajstega.

In [28]:
temp_lj_petek_13[(temp_lj_petek_13==max(temp_lj_petek_13)) | (temp_lj_petek_13==min(temp_lj_petek_13))]

2013-12-13    -0.3
2018-07-13    21.9
Name: povprecna_temperatura, dtype: float64

6. Izračunaj povprečno temperaturo za datume, ki padejo na petek trinajstega v opazovanem obdobju, določenem z `zac_cas` in `kon_cas`.

In [29]:
temp_lj_petek_13.mean()

11.133333333333333

### 4. naloga - temperature - 2. del

Uporabi **tabelo** `temperature` iz prejšnje naloge. Stolpec `datum` popravi, da bo tipa `datetime`.

* Izpiši datume najbolj vročih in najbolj hladnih dni v opazovanem obdobju.
* Izpiši datume s temperaturo, ki ne odstopa za več kot eno stopinjo Celzija od povprečne temperature v tem obdobju.
* Sestavi funkcijo, ki za podano leto in mesec vrne povprečno temperaturo zraka.
* Z uporabo te funkcije sestavi zaporedje povprečnih temperatur po mesecih (zaporedje naj vsebuje eno vrstico za vsak mesec vsakega leta).
    <details><summary>Namig</summary>
    Preveri, kako deluje metoda <a href="https://pandas.pydata.org/docs/reference/api/pandas.Series.apply.html"><code>apply</code></a> na podatkovnih zaporedjih in okvirjih. Kako bi dobil vse mesece in leta v izbranem obdobju?
    </details>
* Izpiši mesece, ko je bila povprečna temperatura najvišja oziroma najnižja.

In [30]:
temperature['datum'] = pd.to_datetime(temperature['datum'])

In [31]:
temperature.datum

0      2010-01-01
1      2010-01-02
2      2010-01-03
3      2010-01-04
4      2010-01-05
          ...
3647   2019-12-27
3648   2019-12-28
3649   2019-12-29
3650   2019-12-30
3651   2019-12-31
Name: datum, Length: 3652, dtype: datetime64[ns]

1. Izpiši datume s temperaturo, ki ne odstopa za več kot eno stopinjo Celzija od povprečne temperature v tem obdobju.

In [32]:
povp = temperature.povprecna_temperatura.mean()
print(povp)

11.999644030668126

In [33]:
temperature.loc[abs(temperature.povprecna_temperatura - povp) <= 1]

          datum  povprecna_temperatura
79   2010-03-21                   11.0
81   2010-03-23                   11.7
82   2010-03-24                   11.7
83   2010-03-25                   12.8
84   2010-03-26                   11.6
...         ...                    ...
3595 2019-11-05                   12.1
3607 2019-11-17                   12.0
3618 2019-11-28                   11.1
3637 2019-12-17                   12.9
3638 2019-12-18                   11.0

[280 rows x 2 columns]

2. Izpiši datume najbolj vročih in najbolj hladnih dni v opazovanem obdobju.

In [34]:
najnizja = temperature.povprecna_temperatura.min()
najvisja = temperature.povprecna_temperatura.max()
print(temperature.loc[temperature.povprecna_temperatura == najnizja])
print(temperature.loc[temperature.povprecna_temperatura == najvisja])

         datum  povprecna_temperatura
765 2012-02-05                   -9.0
          datum  povprecna_temperatura
2772 2017-08-04                   30.0

3. Sestavi funkcijo, ki za podano leto in mesec vrne povprečno temperaturo zraka.

In [35]:
def povprecje(podatki, leto, mesec):
    return podatki.loc[(podatki.datum.dt.month == mesec) & (podatki.datum.dt.year == leto)].povprecna_temperatura.mean()

In [36]:
print(povprecje(temperature, 2012, 1))
print(povprecje(temperature, 2012, 6))
print(povprecje(temperature, 2012, 8))

1.6483870967741934
21.33
23.303225806451614

4. Z uporabo te funkcije sestavi zaporedje povprečnih temperatur po mesecih (indeksi zaporedja naj bodo torej meseci in leta v opazovanem obdobju).

    <details><summary>Namig</summary>
    Preveri, kako deluje metoda <a href="https://pandas.pydata.org/docs/reference/api/pandas.Series.apply.html"><code>apply</code></a> na podatkovnih zaporedjih in okvirjih. Kako bi dobil vse mesece in leta v izbranem obdobju?
    </details>

In [37]:
meseci = pd.date_range(
        temperature.datum.min(), 
        temperature.datum.max(), 
        freq="M"
)
povprecja = pd.Series(meseci).apply(lambda x: povprecje(temperature, x.year, x.month))
povprecja.index = meseci
povprecja

2010-01-31    -1.487097
2010-02-28     1.289286
2010-03-31     6.177419
2010-04-30    11.486667
2010-05-31    15.280645
                ...
2019-08-31    22.606452
2019-09-30    16.820000
2019-10-31    13.248387
2019-11-30     8.753333
2019-12-31     3.587097
Freq: M, Length: 120, dtype: float64

5. Izpiši mesece in leta, ko je bila povprečna temperatura najvišja oziroma najnižja.

In [38]:
najmanj = povprecja.min()
print("Najhladnejši meseci:")
for datum in povprecja[povprecja == najmanj].index:
    print(f"\t* {datum.month}. {datum.year}")

Najhladnejši meseci:
	* 1. 2017

In [39]:
najvec = povprecja.max()
print("Najtoplejši meseci:")
for datum in povprecja[povprecja == najvec].index:
    print(f"\t* {datum.month}. {datum.year}")

Najtoplejši meseci:
	* 7. 2015